Database/Basic-Databse.org
#+AUTHOR: Ertale81
#+TITLE: Database Design and Concept by Caleb Curry
#+STARTDATE: <2025-06-04 Wed>

* Database Intro
- Entity: An entity is a real-world object or concept that can be identified and stored in the database. Every single rows should be the entity type. An entity type is a collection of similar entities — it's like a blueprint or category for a group of entities that share the same attributes. Think of it like a class in programming.
- Table: file, or relation
- Row: record, tuple 
- Attribute: column, fields
- Entity type: the table name
- View: view is a virtual table(behaves like a table) that is based the result of SQL query. It doesn't store the data itself(but it pulls data from the underlying table) but presents data stored in one or more tables in a specific format. You can think of it as a saved SELECT statement. It can be used to simplify complex queries, improve security, or present data in a specific way.
- Database types based on data model:
  1) Relational Databases (RDBMS)
     + Organize data into tables (rows and columns)
     + Use SQL for querying
     + Examples: MySQL, PostgreSQL, Oracle, SQL Server
  2) NoSQL Databases
     + Non-tabular; used for unstructured or semi-structured data
     + Categories include:
       Document-based (e.g., MongoDB, CouchDB)
       Key-value stores (e.g., Redis, DynamoDB)
       Column-family (e.g., Apache Cassandra, HBase)
       Graph-based (e.g., Neo4j, ArangoDB)
  3) Object-Oriented Databases
     + Store data as objects, like in object-oriented programming
       Examples: db4o, ObjectDB
  4) Hierarchical Databases
     + Data is organized in a tree-like structure
       Example: IBM Information Management System (IMS)
  5) Network Databases
     + Data is organized in a graph, allowing more complex relationships
       Example: Integrated Data Store (IDS)



* SQL
- General language used for every RDBMS.
- SQL is used to defines the database then manipulates the data within. SQL is divided into several types, or categories, based on what the commands do. Here are the main types of SQL:
  1) Data Definition Language(DDL):
     + Used to define or modify the database structure, such as tables and schema. Common DDL commands:
       CREATE, ALTER, DROP(deletes a table, view or object), TRUNCATE(removes all rows from the table quickly can't be rolled back)
  2) Data Definition Language(DDL):
     + Used to manipulate data inside the tables. Common DML commands: SELECT, INSERT, DELETE, UPDATE
  3) Data Control Languages(DCL):
     + Used to control access to database. Common commands: GRANT(gives user access privileges), REVOKE(remove user access privileges)
  4) Transaction Control Language(TCL):
     + Used to manage transactions in the database(especially useful with DML operations). Common TCL commands: COMMIT(save all changes made in a transaction), ROLLBACK(undo changes if error occurs), SAVEPOINT(set a point to which you can roll back), SET TRANSACTION(set properties for the transaction)

* Database Designs
- Database design involves organizing data efficiently and logically. This helps for our database not to have data integrity issues and anomalies. There are several types of database designs based on data organization models and how the design supports application needs. Here are the main types of database design that can be applied to SQL, NoSQL, or other systems.
- Normalization is the process of creating a best database design.
  1) Conceptual database design
     + High level, abstract view of the data
     + This is unlimited brainstorming stage. We don't think we can't do because we don't have this amount of space or whatever, we just think what data should be stored.
     + Focuses on *what data* should be stored(what data the system will handle) and the relationship between them
     + Usually represented by Entity-Relationship Diagram(ERD)
     + Doesn't deal how the data is stored physically.
     + Used by business analysts, business architects
     + e.g: "Customers have orders" -- no tables or columns yet.
       
  2) Logical Database Design
     + Converts the conceptual design into *detailed blueprint* that reflects the structure of the data but is independent of any DBMS.
     + Define *tables, columns, data types* and *relationships* -- but still not specific to a database engine
     + Enforces normalization to reduce redundancy.
     + Used by Database designers, system analysts
     + e.g: Table "Customers" with fields like CustomerId, Name...
  3) Physical Database Design
     + Implements the logical design on a specific database system.
     + Focuses on indexing, partitions, storage optimization, and performance.
     + Deals with *how* data is stored: indexing, partitioning, tablespaces, and storage formats.
     + Used by DBAs, System engineers
     + e.g: Creating indexes on CustomerId for faster queries.

* Data Integrity
- It is having correct data in your database. Data integrity in database ensures that the data is accurate, consistent, and reliable throughout its life cycle. When we design our database we don't want repeated values, incorrect values, broken relationship between tables.The three main types of data integrity:
  1) Entity Integrity: Entity is anything that we store data about. This ensures each table should have a unique and not null primary key. Prevents duplicates or missing records and enforces uniqueness within rows.
     e.g: A customer must have a unique CustomerId
  2) Referential Integrity: Maintains consistency between related tables using *foreign  keys*. It ensures that relationships between tables remain valid.
     e.g: An Orders table has a CustomerId that must exist in the customers table.
  3) Domain Integrity: Domain is the acceptable values for a column. Ensures all values in a column fall within a defined set of valid values. Controlled by *data types(e.g. Integer, Character, or String), constraints,* and *rules*.
     e.g: Gender Char(1) CHECK (Gender IN ('M', 'F'))
  4) User-Defined Integrity(Business rules): Enforces rules specific to the business logic that may not be covered by standard integrity types. They are implemented via *trigger, procedures,* or *application logic*
     e.g: A discount can't be applied unless the order total is above $100.
          A customer can't place more than 5 pending orders.

