Database/Basic-Databse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-06 Fri 01:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Database Design and Concept by Caleb Curry</title>
<meta name="author" content="Ertale81" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Database Design and Concept by Caleb Curry</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb79fcff">1. Database Intro</a></li>
<li><a href="#org3547fd9">2. SQL</a></li>
<li><a href="#org4d74389">3. Database Designs</a></li>
<li><a href="#org5754bec">4. Data Integrity</a></li>
<li><a href="#orgac97654">5. Relationships</a></li>
<li><a href="#orgf6ba202">6. Keys</a>
<ul>
<li><a href="#orgca8fcac">6.1. Foreign Key constraints</a></li>
</ul>
</li>
<li><a href="#org36643e3">7. Entity-Relationship</a></li>
<li><a href="#org281fe98">8. Normalization</a></li>
<li><a href="#org8cbd08c">9. Indexes</a></li>
<li><a href="#org19f57e0">10. Join</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb79fcff" class="outline-2">
<h2 id="orgb79fcff"><span class="section-number-2">1.</span> Database Intro</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Entity: An entity is a real-world object or concept that can be identified and stored in the database. Every single rows should be the entity type. An entity type is a collection of similar entities — it's like a blueprint or category for a group of entities that share the same attributes. Think of it like a class in programming.</li>
<li>Table: file, or relation</li>
<li>Row: record, tuple</li>
<li>Attribute: column, fields</li>
<li>Entity type: the table name</li>
<li>View: view is a virtual table(behaves like a table) that is based the result of SQL query. It doesn't store the data itself(but it pulls data from the underlying table) but presents data stored in one or more tables in a specific format. You can think of it as a saved SELECT statement. It can be used to simplify complex queries, improve security, or present data in a specific way.</li>
<li>Database types based on data model:
<ol class="org-ol">
<li>Relational Databases (RDBMS)
<ul class="org-ul">
<li>Organize data into tables (rows and columns)</li>
<li>Use SQL for querying</li>
<li>Examples: MySQL, PostgreSQL, Oracle, SQL Server</li>
</ul></li>
<li>NoSQL Databases
<ul class="org-ul">
<li>Non-tabular; used for unstructured or semi-structured data</li>
<li>Categories include:
Document-based (e.g., MongoDB, CouchDB)
Key-value stores (e.g., Redis, DynamoDB)
Column-family (e.g., Apache Cassandra, HBase)
Graph-based (e.g., Neo4j, ArangoDB)</li>
</ul></li>
<li>Object-Oriented Databases
<ul class="org-ul">
<li>Store data as objects, like in object-oriented programming
Examples: db4o, ObjectDB</li>
</ul></li>
<li>Hierarchical Databases
<ul class="org-ul">
<li>Data is organized in a tree-like structure
Example: IBM Information Management System (IMS)</li>
</ul></li>
<li>Network Databases
<ul class="org-ul">
<li>Data is organized in a graph, allowing more complex relationships
Example: Integrated Data Store (IDS)</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>



<div id="outline-container-org3547fd9" class="outline-2">
<h2 id="org3547fd9"><span class="section-number-2">2.</span> SQL</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>General language used for every RDBMS.</li>
<li>SQL is used to defines the database then manipulates the data within. SQL is divided into several types, or categories, based on what the commands do. Here are the main types of SQL:
<ol class="org-ol">
<li>Data Definition Language(DDL):
<ul class="org-ul">
<li>Used to define or modify the database structure, such as tables and schema. Common DDL commands:
CREATE, ALTER, DROP(deletes a table, view or object), TRUNCATE(removes all rows from the table quickly can't be rolled back)</li>
</ul></li>
<li>Data Definition Language(DDL):
<ul class="org-ul">
<li>Used to manipulate data inside the tables. Common DML commands: SELECT, INSERT, DELETE, UPDATE</li>
</ul></li>
<li>Data Control Languages(DCL):
<ul class="org-ul">
<li>Used to control access to database. Common commands: GRANT(gives user access privileges), REVOKE(remove user access privileges)</li>
</ul></li>
<li>Transaction Control Language(TCL):
<ul class="org-ul">
<li>Used to manage transactions in the database(especially useful with DML operations). Common TCL commands: COMMIT(save all changes made in a transaction), ROLLBACK(undo changes if error occurs), SAVEPOINT(set a point to which you can roll back), SET TRANSACTION(set properties for the transaction)</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org4d74389" class="outline-2">
<h2 id="org4d74389"><span class="section-number-2">3.</span> Database Designs</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Database design involves organizing data efficiently and logically. This helps for our database not to have data integrity issues and anomalies. There are several types of database designs based on data organization models and how the design supports application needs. Here are the main types of database design that can be applied to SQL, NoSQL, or other systems.</li>
<li>Normalization is the process of creating a best database design.
<ol class="org-ol">
<li>Conceptual database design
<ul class="org-ul">
<li>High level, abstract view of the data</li>
<li>This is unlimited brainstorming stage. We don't think we can't do because we don't have this amount of space or whatever, we just think what data should be stored.</li>
<li>Focuses on <b>what data</b> should be stored(what data the system will handle) and the relationship between them</li>
<li>Usually represented by Entity-Relationship Diagram(ERD)</li>
<li>Doesn't deal how the data is stored physically.</li>
<li>Used by business analysts, business architects</li>
<li>e.g: "Customers have orders" &#x2013; no tables or columns yet.</li>
</ul></li>

<li>Logical Database Design
<ul class="org-ul">
<li>Converts the conceptual design into <b>detailed blueprint</b> that reflects the structure of the data but is independent of any DBMS.</li>
<li>Define <b>tables, columns, data types</b> and <b>relationships</b> &#x2013; but still not specific to a database engine</li>
<li>Enforces normalization to reduce redundancy.</li>
<li>Used by Database designers, system analysts</li>
<li>e.g: Table "Customers" with fields like CustomerId, Name&#x2026;</li>
</ul></li>
<li>Physical Database Design
<ul class="org-ul">
<li>Implements the logical design on a specific database system.</li>
<li>Focuses on indexing, partitions, storage optimization, and performance.</li>
<li>Deals with <b>how</b> data is stored: indexing, partitioning, tablespaces, and storage formats.</li>
<li>Used by DBAs, System engineers</li>
<li>e.g: Creating indexes on CustomerId for faster queries.</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org5754bec" class="outline-2">
<h2 id="org5754bec"><span class="section-number-2">4.</span> Data Integrity</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>It is having correct data in your database. Data integrity in database ensures that the data is accurate, consistent, and reliable throughout its life cycle. When we design our database we don't want repeated values, incorrect values, broken relationship between tables.The three main types of data integrity:
<ol class="org-ol">
<li>Entity Integrity: Entity is anything that we store data about. This ensures each table should have a unique and not null primary key. Prevents duplicates or missing records and enforces uniqueness within rows.
e.g: A customer must have a unique CustomerId</li>
<li>Referential Integrity: Maintains consistency between related tables using <b>foreign  keys</b>. It ensures that relationships between tables remain valid.
e.g: An Orders table has a CustomerId that must exist in the customers table.</li>
<li>Domain Integrity: Domain is the acceptable values for a column. Ensures all values in a column fall within a defined set of valid values. Controlled by <b>data types(e.g. Integer, Character, or String), constraints,</b> and <b>rules</b>.
e.g: Gender Char(1) CHECK (Gender IN ('M', 'F'))</li>
<li>User-Defined Integrity(Business rules): Enforces rules specific to the business logic that may not be covered by standard integrity types. They are implemented via <b>trigger, procedures,</b> or <b>application logic</b>
e.g: A discount can't be applied unless the order total is above $100.
	 A customer can't place more than 5 pending orders.</li>
</ol></li>
</ul>
</div>
</div>
