Database/Basic-Databse.html

<div id="outline-container-orgac97654" class="outline-2">
<h2 id="orgac97654"><span class="section-number-2">5.</span> Relationships</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Relationship Types in a Relational Database</li>
<li>One-to-Many (1:N)
Definition: One record in Table A relates to many records in Table B.
Example: One Customer can place many Orders.
How to Detect:
orders.customer<sub>id</sub> is a foreign key referencing customers.id (a primary key).
orders.customer<sub>id</sub> is not unique (i.e., can appear multiple times).</li>
<li>One-to-One (1:1)
Definition: One record in Table A relates to exactly one record in Table B, and vice versa.
How to Detect:
Foreign key in Table B referencing Table A’s primary key.
That foreign key is also UNIQUE in Table B.</li>
<li>Many-to-Many (M:N)
Definition: Many records in Table A relate to many records in Table B.
Implementation: Through a junction table with two foreign keys.
Example:
students, courses, and a junction table student<sub>courses</sub>(student<sub>id</sub>, course<sub>id</sub>)</li>
</ul>
<p>
<b>N.B</b> There is no Many-to-One relationship since it can be views One-to-Many from the other side of the relationship.
</p>
</div>
</div>


<div id="outline-container-orgf6ba202" class="outline-2">
<h2 id="orgf6ba202"><span class="section-number-2">6.</span> Keys</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Keys are special fields (columns) used to identify rows uniquely and manage relationships between tables.</li>
<li>A simple key  is a <b>single column</b> used as a key(like a primary key or foreign key)</li>
<li>A composite key uses two or more columns together to form a key. The combination must be unique, even if the individual columns are not.</li>
<li>Superkey is a set of one or more attributes that uniquely identifies each row. It includes candidate keys and other attributes. It may also contain extra attributes not necessary for uniqueness.
e.g: If StudentID is unique, then StudentID + Name is a super key too &#x2013; but not minimal.
superkey is any number of columns that forces every row to be unique. superkey are not usually defined within the database. Superkey is any number of columns that creates unique rows, a candidate key is the least number of columns. The candidate key is the least number of columns needed to force every row to be unique.</li>
<li>Primary key is a candidate key that UNIQUE, NEVER CHANGING, and NEVER NULL.</li>
<li>Alternate key could be the primary key. Basically it all the candidate key that were not selected as the primary key. You're not required to defined all your candidate keys in your databases. But in some cases you create an index on the alternate key.</li>
<li>Surrogate key and Natural key are categories of primary key. We don't have to define these key in our database. These are for database design to know the difference between different keys. Natural key is something you naturally want to store on the table. When you have a "user", naturally you want to store the "username" and "email". As long as they fulfill the requirements of a primary key, you don't have to make up something(no need of column to add). Natural keys are real-world meaning.</li>
<li>Surrogate key are columns that are added to a database. In every table will only have either a natural key or a surrogate, but can't have both types as a key.</li>
<li>Foreign key:
<ul class="org-ul">
<li>references a primary key on the same table or an a separate table.</li>
<li>are keys that keeps things connected.</li>
<li>you can have multiple columns having foreign key relations to different tables.(in primary we have only one primary key, this primary can be composite or not)</li>
<li><p>
Primary keys are what sorts every individual tables and foreign keys are what connects tables and you will protect that integrity using foreign key constraint.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key type</th>
<th scope="col" class="org-left">Purpose</th>
<th scope="col" class="org-left">Uniqueness</th>
<th scope="col" class="org-left">Nullable</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Primary Key</td>
<td class="org-left">Main unique Identifier</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">Only one per table</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Foreign Key</td>
<td class="org-left">links another table's primary key</td>
<td class="org-left">No</td>
<td class="org-left">Often</td>
<td class="org-left">can multiple per table</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Candidate Key</td>
<td class="org-left">all valid unique identifiers</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">one become the PK</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Alternate Key</td>
<td class="org-left">candidate key not used as PK</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">still unique</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Composite Key</td>
<td class="org-left">key made from multiple attribute</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">common in bridge table</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Surrogate Key</td>
<td class="org-left">system generated ID</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">No business meaning</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Super Key</td>
<td class="org-left">any set uniquely identify row</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">may be non-minimal</td>
</tr>
</tbody>
</table></li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgca8fcac" class="outline-3">
<h3 id="orgca8fcac"><span class="section-number-3">6.1.</span> Foreign Key constraints</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>These protects the integrity of our database. These are constraints that define what will happen to child table if something happens to the parent table. The most common are: ON UPDATE and ON DELETE options</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Option</b></th>
<th scope="col" class="org-left"><b>Behavior</b></th>
</tr>

<tr>
<th scope="col" class="org-left">-------------</th>
<th scope="col" class="org-left">------------------------------------------------------------------------</th>
</tr>

<tr>
<th scope="col" class="org-left">CASCADE</th>
<th scope="col" class="org-left">Automatically updates/deletes child records if parent is updated/deleted</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SET NULL</td>
<td class="org-left">Sets the foreign key to NULL if the parent is deleted</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SET DEFAULT</td>
<td class="org-left">Sets the foreign key to its default value if the parent is deleted</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">RESTRICT</td>
<td class="org-left">Prevents deletion or update if there are matching child records</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">NO ACTION</td>
<td class="org-left">Same as RESTRICT (depends on DB system)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
