Database/Basic-Databse.html


<div id="outline-container-org36643e3" class="outline-2">
<h2 id="org36643e3"><span class="section-number-2">7.</span> Entity-Relationship</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>An Entity-Relationship (ER) Diagram is a graphical representation of entities, attributes, and relationships in a database. It is widely used in database design to visualize how data is structured and interconnected.</li>
<li>Detailed Break down:
<ol class="org-ol">
<li>Entities:
<ul class="org-ul">
<li>Entities are objects or concepts that exist independently in a database.</li>
<li>Types of entities:
<ul class="org-ul">
<li>Strong entities: exist independently(e.g. "Customer", "Product")</li>
<li>Weak entities: depend on another entity(e.g. "Order item" relies on "Order")</li>
</ul></li>
<li>Entities are shown as rectangles in an ER diagram.</li>
</ul></li>
<li>Attributes:
<ul class="org-ul">
<li>They define properties of entities</li>
<li>Types of attributes:
<ul class="org-ul">
<li>Simple attributes: can not broken down further(e.g., "Customer Name")</li>
<li>Composite attributes: can be divided into sub-parts(e.g., "Full Name" &rarr; "First Name" + "Last Name")</li>
<li>Derived attributes: computed from other attributes(e.g., "Age" from "Date of Birth")</li>
<li>Multivalued attributes: can have multiple values(e.g., "Phone Numbers")</li>
</ul></li>
<li>Attributes are represented as ovals.</li>
</ul></li>
<li>Relationships
<ul class="org-ul">
<li>Relationships describe associations between two or more entities.</li>
<li>Types of relationships:
<ul class="org-ul">
<li>One-to-One(1:1): A person has one passport.</li>
<li>One-to-Many(1:M): A customer places multiple orders.</li>
<li>Many-to-Many(M:N): Student enroll in multiple courses.</li>
</ul></li>
<li>Relationships are shown as diamonds with lines connecting related entities.</li>
</ul></li>
<li>Keys:
<ul class="org-ul">
<li>Uniquely identifies entities within a database.</li>
<li>Primary key: A unique identifier, Foreign key: connects one entity to  another, Candidate key: potential primary key options.</li>
</ul></li>
<li>Cardinality and Participation:
<ul class="org-ul">
<li>Defines constraints on relationships.</li>
<li>Cardinality: specifies the number of instances that can relate</li>
<li>The only two possibilities for cardinality are ONE or MANY(1:1, 1:M, M:N). For example, 1:M means one row can be connected to many rows.</li>
<li>Participation: Determines if an entity's involvement in a relationship is mandatory or optional.
<ul class="org-ul">
<li>Mandatory participation(Modality = 1)</li>
<li>Optional participation(Modality = 0)</li>
</ul></li>
<li>Modality is a subset of participation because modality focuses on individual entity instance, while participation considers the entire entity set. Modality defines whether an entity's involvement in a relationship is <b>mandatory(1)</b> or *optional(0). Example: If every student must enroll in at least one course, the "Student" entity has modality 1 in relation to "Course." If a student may or may not enroll, then modality is 0.</li>
<li>Where as Participation specifies whether <b>all</b> instances of an entity <b>must</b> participate in a relationship or if some can exist without it. It can be <b>total participation</b> (every entity must participate in a relationship) or <b>partial participation</b> (some entities may not be involved). Example: In a hospital system, every "Patient" must have a "Medical Record" (total participation), but not every "Doctor" must have a "Surgical Case" (partial participation).</li>
<li>Difference between modality and cardinality:
<ul class="org-ul">
<li>While modality defines the necessity of participation, cardinality describes how many instances of an entity can participate in a relationship.</li>
</ul></li>
</ul></li>
</ol></li>
<li>Uses of ER Diagrams
<ul class="org-ul">
<li>Designing and structuring databases efficiently.</li>
<li>Understanding complex relationships between data.</li>
<li>Communicating database design to stakeholders.</li>
<li>Preventing redundancy and inconsistency in data modeling.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org281fe98" class="outline-2">
<h2 id="org281fe98"><span class="section-number-2">8.</span> Normalization</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Data normalization is the process of organizing a database to <b>reduce redundancy</b> and <b>improve data integrity (consistency and accuracy).</b> Think of it as cleaning up your database design so it’s efficient, consistent, and easy to maintain.</li>
<li>Why Normalize Data?
<ul class="org-ul">
<li>Eliminates duplication (reduces unnecessary repetition of data).</li>
<li>Improves consistency (avoids inconsistencies due to repeated data).</li>
<li>Enhances efficiency (reduces storage needs and speeds up queries).</li>
<li>Simplifies maintenance (changes are easier to apply without errors).</li>
</ul></li>
<li>Normalization in done in different stages, known as <b>normal forms(NF)</b>. Each form fixes a specific type of issue.
<ol class="org-ol">
<li>First Normal Form(1NF):
<ul class="org-ul">
<li>No repeating groups or arrays.</li>
<li>Ensures each column has atomic values(no multiple values in one column)</li>
<li>e.g., Instead of storing multiple phone numbers in one column, they should be placed in separate rows.</li>
</ul></li>
<li>Second Normal Form(2NF):
<ul class="org-ul">
<li>Must be 1NF</li>
<li>All non-key columns must depend on the <b>entire primary key</b> (not just part of it).</li>
<li>Removes <b>partial dependency</b>, ensuring non-key attributes depend on <b>entirely on the primary key</b>.</li>
<li>e.g., If a table contains "Student<sub>ID</sub>" and "Course<sub>ID</sub>", attributes like "Course<sub>Name</sub>" should be moved to separate table, because "Course<sub>Name</sub>" only depends on the "Course<sub>ID</sub>" not "Student<sub>ID</sub>". So this partial dependency should be removed.</li>
<li>Partial dependency is when a column only depends on part of the primary key. In order to depend only part of the primary key, you have to have a compound or composite key(the primary key  has to be multiple columns).</li>
</ul></li>
<li>Third Normal Form(3NF):
<ul class="org-ul">
<li>Must be 2NF</li>
<li>No <b>transitive dependencies</b> (non-key &rarr; non-key)</li>
<li>Non-key attribute 1 depends on another non-key attribute 2 in which the non-key attribute 2 depends on the primary key.</li>
<li>Eliminates <b>transitive dependency</b>, ensuring attributes depend only on the primary key.</li>
<li>e.g., If "Student<sub>ID</sub>" determines "Student<sub>Address</sub>," and "Student<sub>Address</sub>" determines "City<sub>Name</sub>", then "City<sub>Name</sub>" should be moved to another table.</li>
</ul></li>

<li>Boyce-Codd Normal Form (BCNF)
<ul class="org-ul">
<li>Ensures more stringent rules than 3NF, where every functional dependency is enforced properly.</li>
</ul></li>
<li>Fourth Normal Form (4NF)
<ul class="org-ul">
<li>Removes multi-valued dependencies, ensuring records do not have unnecessary duplication of grouped data.</li>
</ul></li>
</ol></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Normal Form</th>
<th scope="col" class="org-left">Fixes What</th>
<th scope="col" class="org-left">Common Violation</th>
</tr>

<tr>
<th scope="col" class="org-left">-----------</th>
<th scope="col" class="org-left">---------------------------------</th>
<th scope="col" class="org-left">---------------------------------------</th>
</tr>

<tr>
<th scope="col" class="org-left">1NF</th>
<th scope="col" class="org-left">Repeating columns or arrays</th>
<th scope="col" class="org-left">Multiple values in a single column</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2NF</td>
<td class="org-left">Partial dependency on primary key</td>
<td class="org-left">Info depends on part of a composite key</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3NF</td>
<td class="org-left">Transitive dependency</td>
<td class="org-left">Info depends on something not a key</td>
</tr>
</tbody>
</table>

<p>
In some cases(especially <b>analytics</b> or <b>performance-focused</b> systems), you might denormalize:
</p>
<ul class="org-ul">
<li>Add redundancy for speed</li>
<li>Avoid joins in big data queries</li>
</ul>
<p>
But for most <b>transactional systems (OLTP)</b>, normalization  is the best practice.
</p>
</div>
</div>
