Database/Basic-Databse.html


<div id="outline-container-org8cbd08c" class="outline-2">
<h2 id="org8cbd08c"><span class="section-number-2">9.</span> Indexes</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>In a database, indexes are special data structures that improve the speed of <b>data retrieval</b>. They work like a table of contents in a book, helping the system find specific records without scanning the entire table. Index is's a special data structure that improves <b>query speed</b>, especially for large tables.</li>

<li>Types of Indexes in Databases:
<ol class="org-ol">
<li>Primary Index:
<ul class="org-ul">
<li>Automatically created on the primary key of a table.</li>
<li>Ensures unique values and fast lookup</li>
</ul></li>
<li>Clustered Index:
<ul class="org-ul">
<li>A clustered index determines the <b>physical order of data storage in a table</b>. This means the rows are stored in the order of the indexed column, making retrieval faster when searching for sequential data.</li>
<li>Key characteristics:
<ul class="org-ul">
<li>There can only be one clustered index per table since the data is stored physically in order.</li>
<li>The actual table data and the index are stored together.</li>
<li>Used in queries where sorting or range-based searching is important.</li>
<li>A table can have only one clustered index.</li>
</ul></li>
<li>e.g., Sorting data by <b>Employee<sub>ID</sub></b></li>
<li>Pros:
<ul class="org-ul">
<li>Faster retrieval for range-based queries, ideal for primary keys as it ensures data is sorted physically, reduces I/O operations, improving performance.</li>
</ul></li>
<li>Cons:
<ul class="org-ul">
<li>Slower INSERT, DELETE, UPDATE operations, as reordering may be required</li>
<li>Can't have multiple clustered indexes in a table</li>
</ul></li>
</ul></li>
<li>Non-Clustered Index:
<ul class="org-ul">
<li>It doesn't change the physical order of data storage. Instead, it creates a separate structure that maintains pointers to the actual data location.</li>
<li>Key Characteristics:
<ul class="org-ul">
<li>A table can have multiple non-clustered indexes.</li>
<li>Useful for fast searching on columns that are frequently queried but not necessary stored.</li>
<li>The actual table data is stored separately from the index.</li>
<li>Stores index separately from the data, improving lookup speed</li>
</ul></li>
<li>Pros:
<ul class="org-ul">
<li>Faster lookup for specific values(e.g., exact name searches)</li>
<li>Can have multiple non-clustered indexes per table</li>
<li>Improves performance for <b>search-heavy tables</b></li>
</ul></li>
<li>Cons:
<ul class="org-ul">
<li>Slower than clustered index for <b>rang queries</b> (e.g., between two values)</li>
<li>Require extra storage to maintain separate index structures.</li>
</ul></li>
<li>e.g., Indexing <b>Last<sub>Name</sub></b> separately for quick searches.</li>
</ul></li>
<li>Unique Index:
<ul class="org-ul">
<li>Ensures <b>no duplicate values</b> in a column</li>
<li>Used for enforcing <b>uniqueness constraints</b></li>
</ul></li>
</ol></li>

<li>Why Use Indexes?
<ul class="org-ul">
<li>Faster Queries: Reduces search time for large datasets.</li>
<li>Efficient Sorting: Improves sorting operations on columns.</li>
<li>Enhances JOIN Performance: Helps link related tables efficiently.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org19f57e0" class="outline-2">
<h2 id="org19f57e0"><span class="section-number-2">10.</span> Join</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ertale81</p>
<p class="date">Created: 2025-06-06 Fri 01:50</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
